000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. HELLO.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 01 HELLO1      PIC X(30).
000600 01 HELLO2.
000700     03 FILLER  PIC X(06) VALUE 'HELLO,'.
000800     03 FILLER  PIC X(01) VALUE SPACE.
000900     03 FILLER  PIC X(06) VALUE 'WORLD!'.
001000     03 FILLER  PIC X(01) VALUE SPACE.
001100     03 FILLER  PIC 9(01) VALUE 2.
001200 PROCEDURE DIVISION.
001300     MOVE 'こんにちは、世界！そしてニホん 1' TO HELLO1.
001400     DISPLAY HELLO1.
001500     DISPLAY HELLO2.
001600     STOP RUN.
