*>計算する
IDENTIFICATION DIVISION.
PROGRAM-ID. SAMPLE_04.

ENVIRONMENT DIVISION.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A PIC 9(3).
01 B PIC 9(3).
01 C PIC 9(3).

PROCEDURE DIVISION.
MAIN.
	MOVE 16 TO A
	MOVE 4 TO B
	COMPUTE C = (A + B) * 2
	DISPLAY "計算結果は " C
	STOP RUN.
