*>日付を表示する
IDENTIFICATION DIVISION.
PROGRAM-ID. SAMPLE_07.

ENVIRONMENT DIVISION.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 DATE-REC.
	02 D-Y PIC 99.
	02 D-M PIC 99.
	02 D-D PIC 99.

PROCEDURE DIVISION.
MAIN.
	ACCEPT DATE-REC FROM DATE
	DISPLAY D-Y "年" D-M "月" D-D "日"
	STOP RUN.
