IDENTIFICATION DIVISION.
PROGRAM-ID. SAMPLE_09.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 N PIC S9(3)V99.

PROCEDURE DIVISION.
MAIN.
    DISPLAY "数値を入力"
    ACCEPT N
    IF N > 0 THEN
        DISPLAY "N は正の数です"
    END-IF
    STOP RUN.



