*>キーボードから値を入力する
IDENTIFICATION DIVISION.
PROGRAM-ID. SAMPLE_06.

ENVIRONMENT DIVISION.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 PI PIC 9V99 VALUE 3.14.
01 R PIC 999V99.
01 S PIC ZZZ9.99.

PROCEDURE DIVISION.
MAIN.
	DISPLAY "半径を入力してください"
	ACCEPT R
	COMPUTE S = PI * R ** 2
	DISPLAY "面積は " S
	STOP RUN.
