*>無名項目を使う
IDENTIFICATION DIVISION.

PROGRAM-ID. SAMPLE_08.

ENVIRONMENT DIVISION.

*>Set character set to UTF-8
CONFIGURATION SECTION.
SOURCE-COMPUTER.UTF-8.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 DATE-REC.
	02 D-Y PIC 99.
	02 D-M PIC 99.
	02 D-D PIC 99.
01 EDIT-REC.
    02 E-Y PIC 99.
    02 FILLER PIC X(3) VALUE "年". *> Comment: Represents "年"
    02 E-M PIC 99.
    02 FILLER PIC X(3) VALUE "月". *> Comment: Represents "月"
    02 E-D PIC 99.
    02 FILLER PIC X(3) VALUE "日". *> Comment: Represents "日".

PROCEDURE DIVISION.
MAIN.
	ACCEPT DATE-REC FROM DATE
	MOVE D-Y TO E-Y
	MOVE D-M TO E-M
	MOVE D-D TO E-D
	DISPLAY EDIT-REC
	STOP RUN.
