*>VALUE句で初期値を指定する
IDENTIFICATION DIVISION.
PROGRAM-ID. SAMPLE_05.

ENVIRONMENT DIVISION.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A PIC 9 VALUE 3.
01 B PIC 9 VALUE 2.
01 C PIC ZZ9.

PROCEDURE DIVISION.
MAIN.
	COMPUTE C = A ** B
	DISPLAY A " の " B " 乗は " C
	STOP RUN.
