*>条件判断（３）
IDENTIFICATION DIVISION.
PROGRAM-ID. SAMPLE_11.

ENVIRONMENT DIVISION.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 TEN1 PIC 9(3).
01 TEN2 PIC 9(3).

PROCEDURE DIVISION.
MAIN.
	DISPLAY "得点１を入力"
	ACCEPT TEN1
	DISPLAY "得点２を入力"
	ACCEPT TEN2
	IF TEN1 >= 70 AND TEN2 >= 70 THEN
		DISPLAY "合格"
	ELSE
		DISPLAY "不合格"
	END-IF
	STOP RUN.
